Repository: tazmanska/home-sim-cockpit
Catalog: DomowyPanelApp/Resources.*.resx
Languages: pl

source: Console
pl: Konsola

# ProgramStart
source: Application starting...
pl: Start programu

# StartMinimized
source: Starting application in minimized mode...
pl: Uruchomienie aplikacji zminimalizowanej...

# ProcessPriorityClassIdle
source: Low
pl: Niski

# ProcessPriorityClassBelowNormal
source: Below normal.
pl: Poniżej normalnego

# ProcessPriorityClassAboveNormal
source: Above normal.
pl: Powyżej normalnego

# ProcessPriorityClassHigh
source: High
pl: Wysoki

# ProcessPriorityClassRealTime
source: Real time
pl: Czasu rzeczywistego

# ProcessPriorityClassNormal
source: Normal
pl: Normalny

source: Processor
pl: Procesor

source: Information
pl: Informacja

# ScriptStarted
source: Script '{0}' started.
pl: Skrypt '{0}' został uruchomiony.

# ScriptStopped
source: Script '{0}' stopped.
pl: Zakończono wykonywanie skryptu '{0}'.

# ScriptExecutingError
source: Error ocurred during executing script '{0}'.
pl: Wystąpił błąd podczas wykonywania skryptu '{0}'.

source: Select file...
pl: Wskaż plik...

source: Clear history
pl: Wyczyść historię

# HCPSFilesFilter
source: Script file HCPS (*.hcps)|*.hcps
pl: Plik skryptów HCPS (*.hcps)|*.hcps

# LoadingScriptsFile
source: Loading scripts from file '{0}'...
pl: Wczytywanie skryptów z pliku '{0}'...

# NumberOfLoadedScripts
source: Number of loaded scripts: {0}.
pl: Ilość wczytanych skryptów: {0}.

# LoadingFileError
source: Error occured during loading scripts file.
pl: Błąd podczas wczytywania pliku skryptów.

# ScriptLogPrefix
source: Script: {0}
pl: Skrypt: {0}

source: Loading modules...
pl: Wczytywanie modułów wejścia/wyjścia...

# IgnoringInputModule
source: Omitting input module '{0}' (module already loaded).
pl: Pomijam moduł wejściowy o nazwie '{0}', moduł o takiej nazwie został już wczytany.

# IgnoringOutputModule
source: Omitting output module '{0}' (module already loaded).
pl: Pomijam moduł wyjściowy o nazwie '{0}', moduł o takiej nazwie został już wczytany.

# InputModule
source: Input module : {0}
pl: Moduł wejścia: {0}

# OutputModule
source: Output module: {0}
pl: Moduł wyjścia: {0}

# LoadingModulesError
source: Error occured during loading input/output modules.
pl: Błąd podczas wczytywania modułów wejścia/wyjścia.

# NumberOfLoadedModules
source: Modules loaded: {0}
pl: Wczytano modułów: {0}

# NumberOfInputModules
source: Input: {0}
pl: Wejścia: {0}

# NumberOfOutputModules
source: Output: {0}
pl: Wyjścia: {0}

# NumberOfVariables
source: Number of variables: {0}
pl: Ilość zmiennych: {0}

# NumberOfInputVariables
source: Input: {0}
pl: Wejścia: {0}

# NumberOfOutputVariables
source: Output: {0}
pl: Wyjścia: {0}

# ModuleVariables
source: Module's variables:
pl: "Zmienne modułu:"

# ModuleFunctions
source: Module's functions:
pl: Funkcje modułu:

# ImproprietyModuleNameForFunctions
source: Any module that export functions, has to have a proper name (only letters and digits are allowed). Module '{0}' has improper name and any function of it can be used.
pl: Moduł udostępniający funkcje musi mieć odpowiednią nazwę (składającą się tylko z liter i cyfr). Moduł '{0}' udostępnia funkcje ale nie można ich użyć ze względu na nieodpowiednią nazwę modułu.

source: Warning
pl: Uwaga

# ModuleVariablesWithNumber
source: Module's variables ({0}):
pl: Zmienne modułu ({0}):

# ModuleFunctionsWithNumber
source: Module's functions ({0}):
pl: Funkcje modułu ({0}):

source: Error
pl: Błąd

# ModuleNotFound
source: Module '{0}' not found.
pl: Nie znaleziono modułu o nazwie '{0}'.

# VariableNotFoundInModuleVariables
source: Variable of ID '{1}' not found in module '{0}'.
pl: W module '{0}' nie znaleziono zmiennej o identyfikatorze '{1}'.

# IncorrectVariableTypeDeclared
source: Declared variable '{0}' has declared different type ('{1}') then it has ('{2}') in module '{3}'.
pl: Zmienna '{0}' ma zadeklarowany typ ({1}) niezgodny z typem zadeklarowanym ({2}) w module '{3}'.

# ModuleCannotProcessVariable
source: Module '{0}' cannot process varialbe '{1}' of type '{2}'.
pl: Moduł '{0}' nie może przetworzyć zmiennej '{1}' typu '{2}'.

# DuplicatedVariable
source: Variable of ID '{0}' already exists !.
pl: Zmienna o identyfikatorze '{0}' występuje conajmniej dwukrotnie !.

# BeginExecuteScript
source: Starting script '{0}'...
pl: Uruchamianie skryptu '{0}'...

# ExecutingScript
source: Running script: {0}
pl: Uruchomiony skrypt: {0}

# ExecutingScriptThread
source: Script thread started...
pl: Uruchomiono wątek skryptu...

# EndingExecuteScript
source: Stopping script...
pl: Kończenie działania skryptu...

source: unknown module
pl: nieznany moduł

# StopScriptBeforeCloseApplication
source: Script has to be stopped before closing application.
pl: Zakończ działanie skryptu przed zamknięciem programu.

# StopScript
source: Stop '{0}'
pl: Zatrzymaj '{0}'

source: Stop
pl: Zatrzymaj

# LogFileFilters
source: Text file TXT|*.txt|Any file|*.*
pl: Plik tekstowy TXT|*.txt|Dowolny plik|*.*

# RestartApplicationToChangeLanguage
source: To apply language change application has to be restarted.
pl: Aby zmiana języka została zastosowana, należy zamknąć i uruchomić aplikację.

# CannotReadExpression
source: Cannot parse expression at position '{0}'.
pl: Nie można odczytać wyrażeń z pozycji '{0}'.

# CannotSetValueToExpression
source: Cannot assign value to expression '{0}'.
pl: Nie można przypisać wartości do wyrażenia '{0}'.

# CyclicalVariableLinkingFound
source: Cycled argument '{0}' linking found in function '{1}'.
pl: Wykryto cykliczne powiązanie argumentu '{0}' w funkcji '{1}'.

# IncorrectFunctionDefinition
source: Invalid definition of function at position {0}.
pl: Błędna definicja funkcji, pozycja {0}.

# CannotOverrideBuiltinFunction
source: Cannot override built-in '{0}' function.
pl: Istnieje funkcja wbudowana o nazwie '{0}', nie można jej nadpisać.

# IncorrectFunctionInvocation
source: Invalid execute of funtcion statement at position {0}.
pl: Błędne wywołanie funkcji, pozycja {0}.

# IncorrectArgumentNumber
source: Incorrect number of function '{0}' parameters, expected {1} parameters.
pl: Nieprawidłowa ilość parametrów funkcji '{0}', oczekiwano {1}.

# FunctionNotFound
source: Function '{0}' does not exist.
pl: Nie istnieje funkcja o nazwie '{0}'.

# IncorrectArgumentNumber2
source: Incorrect number of function '{1}:{0}' paramateres, expected {2} parameters.
pl: Nieprawidłowa ilość parametrów funkcji '{0}' z modulu '{1}', oczekiwano {2} parametrów.

# FunctionNotFoundInModule
source: Function '{1}' not found in module '{0}'.
pl: W module '{0}' nie istnieje funkcja o nazwie '{1}'.

# CannotConvertValueToType
source: Cannot convert value '{0}' from '{1}' type to '{2}' type.
pl: Nie można wykonać konwersji wartości '{0}' typu '{1}' na typ '{2}'.

# ValueMustBeIntOrDouble
source: Argument may be only of type 'double' or 'int'.
pl: Argument musi być typu double lub int.

# FunctionArgumentMayBeOnlyVariable
source: Only variable may be an argument of function '{0}'.
pl: Argumentem funkcji '{0}' może być tylko zmienna.

# WrongBitNumberForFunction
source: Bit index in function '{0}' may be >= 0.
pl: Indeks bitu dla funkcji '{0}' musi być >= 0.

# WrongGetNameFunctionArgument
source: Argument for function 'GetName(...)' may be only variable or constant.
pl: Argumentem funkcji 'GetName(...)' może być tylko zmienna lub stała.

# WrongGetIDFunctionArgument
source: Argument for function 'GetID(...)' may be only variable from input or output module.
pl: Argumentem funkcji 'GetID(...)' może być tylko zmienna z modułu wejścia lub wyjścia.

# WrongGetSizeFunctionArgument
source: Wrong argument type '{0}' for function 'GetSize(...)'.
pl: Nieprawidłowy typ '{0}' tablicy przekazanej do funkcji 'GetSize(...)'.

# WrongArraySize
source: Cannot create array of size '{0}', minimal size of array: 0.
pl: Nie można utworzyć tablicy o rozmiarze '{0}', minimalny rozmiar to 0.

# WrongSetSizeFunctionArgumentType
source: Argument '{0}' for function 'SetSize(...)' is not of array type.
pl: Argument '{0}' funkcji 'SetSize(...)' nie jest typu tablicowego.

# ArgumentIsNotVariable
source: Argument '{0}' of function '{1}' is not a variable.
pl: Argument '{0}' funkcji '{1}' nie jest zmienną.

# ArrayNotInitialized
source: '{0}' array in '{1}' function is not initialized.
pl: Przekazana tablica '{0}' do funkcji '{1}' nie jest zainicjowana.

# UnsetValueInArray
source: Not initialized value at index '{1}' in array '{0}'.
pl: Niezainicjowana wartość w tablicy '{0}' pod indeksem '{1}'.

# UnsupportedValueTypeInArray
source: Not supported type '{0}' at index '{2}' in array '{1}'.
pl: Nieobsługiwany typ '{0}' elementu tablicy '{1}' z indeksu '{2}'.

# UnsupportedArrayType
source: Not supported type '{0}' of array '{1}'.
pl: Nieobsługiwany typ '{0}' tablicy '{1}'.

# NoValueInArrayAtIndex
source: No value at index '{0}' in array '{1}'.
pl: Nie istnieje element o indeksie '{0}' w tablicy '{1}'.

# UnsetValueForArray
source: Not initialized value for set at index '{1}' in array '{0}'.
pl: Przekazana wartość do ustawienia w tablicy '{0}' pod indeksem '{1}' jest niezainicjowana.

# ArrayIndexOutOfBound
source: Index from range '{0}' - '{1}' is out of '{2}' array boundary.
pl: Podany zakres od '{0}' do '{1}' wykracza poza rozmiar tablicy '{2}'.

# InvalidTokenAfterModuleName
source: Invalid token ('{0}') after module name ('{1}').
pl: Błędny token ('{0}') po nazwie modułu ('{1}'). Po nazwie modułu musi następować nazwa obiektu z danego modułu (np. nazwa funkcji).

# OperationNotAllowed
source: Operation is not allowed.
pl: Niedozwolona operacja.

# CannotReadExpression2
source: Cannot parse expression, token '{0}', value '{1}', position '{2}'.
pl: Nie można odczytać wyrażenia, token '{0}', wartość '{1}', pozycja '{2}'.

# VariableOrConstantNotFound
source: Variable or constant '{0}' not found.
pl: Nie znaleziono zmiennej ani stałej o nazwie '{0}'.

source: no name
pl: brak nazwy

source: constant
pl: stała

source: variable
pl: zmienna

# IncorrectEventDefinition
source: Incorrect definition of variable value changed event at position {0}.
pl: Błędna definicja zdarzenia zmiany wartości zmiennej, pozycja {0}.

# EventsAreAllowedOnlyForVariables
source: Variable value changed event may be declared only for variables (found declaration for '{0}').
pl: Zdarzenie zmiany wartości może być zdefiniowane tylko dla zmiennych (zdarzenie dla '{0}').

# IncorrectNumberForVariablesChangeEvent
source: Invalid number format ('{0}') in declaration of variables values changed event.
pl: Nieprawidłowy format liczby ('{0}') w nagłówku zdarzenia zmiany wielu zmiennych.

# RepeatedVariableInVariablesChangeEvent
source: Duplicated declaration of variable '{0}' within variables values changed event.
pl: Ponowne wskazanie zmiennej '{0}' w deklaracji zdarzenia zmiany wielu zmiennych.

# VariablesChangeEventRequireAtLeastTwoVariables
source: Variables values changed event require at least two variables.
pl: Zdarzenie zmiany wielu zmiennych musi mieć wskazane co najmniej 2 zmienne.

# IncorrectVariablesChangeEventDefinition
source: Invalid variable value change definition at position {0}.
pl: Błędna definicja zdarzenia zmiany wartości zmiennej, pozycja {0}.

# NotEnoughVariablesForVariablesChangeEvent
source: Variables values changed event require at least two variables. Number of declared variables: {0}.
pl: Nie zadeklarowano odpowiedniej (minimum 2) zmiennych zdarzenia zmiany wielu zmiennych. Zadeklarowano: {0}.

# IncorrectVariablesChangedMinimumForVariablesChangedEvent
source: Invalid number of variables whithin variables values change event (number must be from range 0 - number of variables).
pl: Źle określone minimum (0) zmienionych zmiennych w zdarzeniu zmiany wielu zmiennych. Minium musi być większe od 0 i mniejsze lub równe ilości wskazanych zmiennych.

# CannotSetValueToInputVariable
source: Cannot set value to input variable '{0}'.
pl: Nie można ustawiać wartości zmiennej '{0}' w skrypcie, bo jest to zmienna wejściowa.

# IncorrectValueTypeForVariable
source: Value type ('{2}') does not match variable ('{0'} type ('{1}').
pl: Próba ustawienia wartości innego typu, zmienna: '{0}', typ zmiennej: {1}, typ wartości ustawianej: {2}.

# IncorrectVariableDefinition
source: Invalid variable '{0}' definition.
pl: Błąd w definicji zmiennej '{0}'.

# InvalidVariableDefinitionProperty
source: Invalid variable ('{1}') definition property '{0}' at position '{2}'.
pl: Nieznana właściwość '{0}' zmiennej '{1}' z pozycji '{2}'.

# CannotParseVariableDefinition
source: Cannot parse variable definition at position '{0}'.
pl: Nie można odczytać definicji zmiennej o nazwie '{0}'.

# InvalidVariableDefinition
source: Cannot parse variable deifinition at position '{0}'.
pl: Nie można odczytać definicji zmiennej z pozycji '{0}'.

# IncorrectNumberOfVariablesForVariableFunction
source: Function '{0}' for variable '{1}' accept '{2}' argyments. Function for variable may accept only one argument.
pl: Funkcja '{0}' przypisana do zmiennej '{1}' przyjmuje parametrów: '{2}'. Funkcja zmiennej musi przyjmować dokładnie jeden parametr.

# UndefinedVariableDirection
source: Undefined direction of variable '{0}'.
pl: Nieokreślony kierunek zmiennej '{0}'.

# IncorrectNumberFormatTypeIntForVariableInitialization
source: Invalid number format of int type ('{0}') for variable '{1}'.
pl: Nieprawidłowy format liczby typu 'int' ({0}), zmienna '{1}'.

# IncorrectNumberFormatTypeDoubleForVariableInitialization
source: Invalid number format of double type ('{0}') for variable '{1}'.
pl: Nieprawidłowy format liczby typu 'double' ({0}), zmienna '{1}'.

# CannotInitailizeVariableOfType
source: Cannot initialize '{0}' variable of '{1}' type in its declaration.
pl: Nie można zainicjalizować wartości zmiennej '{0}' typu '{1}' w definicji zmiennej.

# CannotCheckStatementForNullValue
source: Cannot check '{0}' statement for null value.
pl: Nie można sprawdzić warunku '{0}' dla wartości null.

# UnsupportedValueType
source: Not supported type '{0}'.
pl: Nieobsługiwany typ '{0}'.

# UnsupportedStatementTypeForArray
source: Logic statement '{0}' is not supported for arrays.
pl: Nieobsługiwany warunek logiczny '{0}' dla tablic.

# UnsupportedStatementTypeForValueType
source: Condition operator '{0}' is not supported for type {1}.
pl: Nieobsługiwany warunek '{0}' dla typu {1}.

# UnrecognizedStatementType
source: Logic statement not found for token '{0}'.
pl: Nie znaleziono odpowiednika warunku logicznego dla tokena '{0}'.

# IncorrectElseStatementInIfStatementDefinition
source: Invalid 'if' statement with 'else' statement at position {0}.
pl: Nieprawidłowa definicja warunku 'if' w bloku 'else', pozycja {0}.

# IncorrectIfStatementDefinition
source: Invalid 'if' statement declaration.
pl: Nieprawidłowa definicja warunku 'if'.

# ValueCanBeParsedOnlyFromString
source: Parsing is allowed only for type 'string'.
pl: Parsowanie jest dostępne tylko dla typu 'string'.

# UnsupportedTypeParsing
source: Parsing type '{0}' is not supported.
pl: Parsowanie typu '{0}' nie jest obsługiwane.

# IncorrectBoolValue
source: Invalid valut '{0}' of bool type.
pl: Niepoprawna wartość '{0}' typu 'bool'.

# UnsupportedDirectionType
source: Not supported direction '{0}'.
pl: Nieobsługiwany kierunek '{0}'.

source: Cannot change constant value.
pl: Nie można zmienić wartości stałej.

# IncorrectConstantDefinition
source: Invalid constant '{0}' definition.
pl: Nieprawidłowa definicja stałej '{0}'.

# InvalidConstantType
source: Invalid constant '{1}' type '{0}'. Warning! Constants may be only simple value type (bool, int, double, string).
pl: Nieprawidłowy typ '{0}' stałej '{1}'. Uwaga! Stałe mogą być tylko typu prostego.

# InvalidConstantDefinitionProperty
source: Invalid property '{0}' of constantj '{1}' at position '{2}'.
pl: Nieznana właściwość '{0}' stałej '{1}' z pozycji '{2}'.

# CannotParseConstantDefinition
source: Cannot parse constant definition at positioni '{0}'.
pl: Nie można odczytać definicji stałej z pozycji '{0}'.

# MissingConstantValue
source: No value for constant '{0}'.
pl: Nie określono wartości stałej '{0}'.

# IncorrectNumberFormatTypeIntForConstantInitialization
source: Invalid number format of int type ('{0}') for constant '{1}'.
pl: Nieprawidłowy format liczby typu 'int' ({0}), stała '{1}'.

# IncorrectNumberFormatTypeDoubleForConstantInitialization
source: Invalid number format of double type ('{0}') for constant '{1}'.
pl: Nieprawidłowy format liczby typu 'double' ({0}), stała '{1}'.

# InvalidConstantValueType
source: Invalid value for constant '{0}'. Warning! Constants may be only simple value type (bool, int, double, string).
pl: Nieprawidłowa wartość stałej '{0}'. Uwaga! Stałe mogą być tylko typu prostego.

# UnsupportedScriptFileType
source: Not supported scripts file format.
pl: Nieznany format pliku ze skryptami.

# VariableRedefinition
source: Redefinition of variable of ID '{0}' from module '{1}'. Variable '{2}'.
pl: Redefinicja zmiennej o identyfikatorze '{0}' z modułu '{1}'. Zmienna '{2}'.

# VariableRedefinition2
source: Redefinition of variable of ID '{0}' from module '{1}'. Variable '{2}' at position '{3}'.
pl: Redefinicja zmiennej o identyfikatorze '{0}' z modułu '{1}'. Zmienna '{2}', pozycja '{3}'.

# ConstantRedefinition
source: Redefinition of constatnt '{0}'.
pl: Redefinicja stałej o nazwie '{0}'.

# ConstantRedefinition2
source: Redefinition of constant '{0}' at position '{1}'.
pl: Redefinicja stałej o nazwie '{0}', pozycja '{1}'.

# UnsupportedEventType
source: Unknown type of event '{0}'.
pl: Nieznany typ zdarzenia '{0}'.

# VariableChangeEventRedefinition
source: Redefinition of variable value change event for variable '{0}'.
pl: Redefinicja zdarzenia zmiany zmiennej '{0}'.

# VariableChangeEventRedefinition2
source: Redefinition of variable value change event for variable '{0}' at position '{1}'.
pl: Redefinicja zdarzenia zmiany zmiennej '{0}', pozycja '{1}'.

# VariablesChangedEventRedefinition
source: Redefinition of variables values changed event (duplicated list of variables).
pl: Redefinicja zdarzenia zmiany wielu zmiennych (taka sama lista zmiennych i taka sama liczba minimum).

# VariablesChangedEventRedefinition2
source: Redefinition of variables values changed event (duplicated list of variables) at position '{0}'.
pl: Redefinicja zdarzenia zmiany wielu zmiennych (taka sama lista zmiennych i taka sama liczba minimum), pozycja '{0}'.

# FunctionRedefinition
source: Redefinition of function '{0}'.
pl: Redefinicja funkcji o nazwie '{0}'.

# FunctionRedefinition2
source: Redefinition of function '{0}' at position '{1}'.
pl: Redefinicja funkcji o nazwie '{0}', pozycja '{1}'.

# LoadingFile
source: Loading file '{0}'...
pl: Wczytywanie pliku '{0}'...

# ScriptAlreadyExists
source: Script '{0}' already exists in this file.
pl: Skrypt o nazwie '{0}' istnieje już w tym pliku.

# LoadingScript
source: Loading script '{0}'...
pl: Wczytywanie skryptu '{0}'...

# LoadingScriptsFileCanceledByUser
source: Loading scripts cancelled by user.
pl: Wczytywanie skryptów zostało anulowane przez użytkownika.

# SpecialEventRedefinition
source: Special event '{0}' redefinition at position '{1}'.
pl: Redefinicja specjalnego zdarzenia '{0}', pozycja '{1}'.

# IncorrectSpecialEventDefinition
source: Invalid special event '{0}' declaration at position '{1}'.
pl: Błędna definicja specjalnego zdarzenia '{0}', pozycja '{1}'.

# UnsuportedDefinitionType
source: Unknown definition word '{0}' at position '{1}'.
pl: Nieznane słowo definiujące '{0}', pozycja '{1}'.

# ScriptSyntaxError
source: Syntax error in script at position '{0}'.
pl: Błąd składniowy skryptu, pozycja '{0}'.

source: Cannot join scripts from one file.
pl: Nie można łączyć skryptów z tego samego pliku.

# ScriptNotFoundInFile
source: Script '{1}' not found in file '{0}'.
pl: W pliku '{0}' nie istnieje skrypt '{1}'.

# UnrecognizedString
source: Unknown string '{0}' at position '{0}'.
pl: Nierozpoznany ciąg '{0}', pozycja '{0}'.

# UnsupportedOperator
source: Not supported operator '{0}'.
pl: Nieobsługiwany operator '{0}'.

# CannotAddValues
source: Cannot add values of different types.
pl: Nie można wykonać dodawania przekazanych typów danych.

# CannotSubtractValues
source: Cannot subtract values of different types.
pl: Nie można wykonać odejmowania przekazanych typów danych.

# CannotMultiplyValues
source: Cannot multiply given values.
pl: Nie można wykonać mnożenia przekazanych typów danych.

# CannotDivideValues
source: Cannot divide values of different types.
pl: Nie można wykonać dzielenia przekazanych typów danych.

# CannotANDValues
source: Cannot make bit AND operation (wrong values types).
pl: Nie można wykonać operacji AND na przekazanych danych (zły typ danych).

# CannotORValues
source: Cannot make bit OR operation (wrong values types).
pl: Nie można wykonać operacji OR na przekazanych danych (zły typ danych).

# CannotMODValues
source: Cannot do modulo divide with parameters: '{0}' of '{1}' type and '{2}' of '{3}' type.
pl: Nie można wykonać operacji modulo (%) na parametrach: '{0}' typu '{1}' i '{2}' typu '{3}'.

source: Expression not found.
pl: Nie znaleziono wyrażenia.

# IncorrectIncludeDefinition
source: Invalid 'include' statement.
pl: Błąd w dyrektywie include.

# InvalidIncludePropertyDefinition
source: Invalid include property '{0}' of include statement at position '{1}'.
pl: Nieznana właściwość '{0}' dyrektywy include z pozycji '{1}'.

# MissingFileOrScriptPropertyInIncludeDefinition
source: No property 'file' and/or 'script' within 'include' statement.
pl: Brak parametru 'file' i/lub 'script' w dyrektywie include.

# CannotReadIncludeDefinition
source: Cannot parse include statement at positon '{0}'.
pl: Nie można odczytać dyrektywy include z pozycji '{0}'.

# UnrecognizedCharacter
source: Unknown character '{0}' at position {1}.
pl: Nierozpoznany znak '{0}' od pozycji {1}.

# CannotReadAssignmentDefinition
source: Cannot parse assignment statement at position '{0}'.
pl: Nie można odczytać operacji przypisania z pozycji '{0}'.

# RowCharacter
source: line {0}, character {1}
pl: linia {0}, znak {1}

# UpdateError
source: Error occured during updates checking.
pl: Błąd podczas sprawdzania aktualizacji.

# UpdateChecking
source: Updates checking...
pl: Sprawdzanie aktualizacji...

# NoUpdate
source: No updates available.
pl: Brak aktualizacji.

# UpdateInfo
source: Updates available! Start update application from Settings view.
pl: Znaleziono aktualiacje ! Uruchom aktualizacje z widoku Ustawienia.

# UpdateNow
source: Update
pl: Aktualizuj

source: Question
pl: Pytanie

# UpdateQuestion
source: Updates found. Do You want to start updating process ?
pl: Znaleziono aktualizacje. Uruchomić proces aktualizacji ?
